# Lab | Data Cleaning and Formatting

Objective: Apply Python programming to perform data cleaning and formatting, including identifying and handling with missing values, duplicates, outliers, errors, and using various formatting techniques such as changing data types, renaming columns, and handling string values, to prepare data for analysis.

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

In [1]:
# Your code here
import pandas as pd
import re

my_csv = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")#read cSV
my_df = pd.DataFrame(my_csv)
#Geting columns names
def lower_clean_columns(column_name):
    column_name = re.sub(r"[^\w\s\%]", " ", str(column_name).lower())
    return column_name
my_df.columns = [lower_clean_columns(i) for i in my_df.columns]

my_df.head()

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they contain only valid data. For example, the gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

In [2]:
# Your code here
my_df["gender"].value_counts()

gender
F         457
M         413
Male       39
female     28
Femal      17
Name: count, dtype: int64

In [3]:
my_df["gender"] = my_df["gender"].replace("Male","M")
my_df["gender"] = my_df["gender"].replace("female","F")
my_df["gender"] = my_df["gender"].replace("Femal","F")

In [4]:
my_df["gender"].value_counts()

gender
F    502
M    452
Name: count, dtype: int64

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

In [5]:
my_df["customer lifetime value"] = my_df["customer lifetime value"].replace("NULL","0")
my_df

,customer,st,gender,education,customer lifetime value,income,monthly premium auto,number of open complaints,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...,...,...
4003,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4004,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4005,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4006,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4007,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
# Your code here
my_df_types = my_df.convert_dtypes()
my_df_types["customer lifetime value"] = my_df_types["customer lifetime value"].str.rstrip('%')#Elitminates all the strings
my_df_types["customer lifetime value"] = my_df_types["customer lifetime value"].astype(float)

In [7]:
def types_setting(df):
    df = my_df.convert_dtypes()
    df["customer lifetime value"] = df["customer lifetime value"].str.rstrip('%')#Elitminates all the strings
    df["customer lifetime value"] = df["customer lifetime value"].astype(float)
    return df
my_dff=types_setting(my_df)
my_dff.dtypes

customer                     string[python]
st                           string[python]
gender                       string[python]
education                    string[python]
customer lifetime value             float64
income                                Int64
monthly premium auto                  Int64
number of open complaints    string[python]
policy type                  string[python]
vehicle class                string[python]
total claim amount                  Float64
dtype: object

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the isnull() function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (we haven't studied this yet)

Implement your chosen strategy to handle the null values. You can use the fillna() function in pandas to fill null values or dropna() function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the isnull() function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers using applymap.

Save the cleaned dataset to a new CSV file.

In [8]:
# Your code here
my_df_types.isnull().sum()

customer                     2937
st                           2937
gender                       3054
education                    2937
customer lifetime value      2940
income                       2937
monthly premium auto         2937
number of open complaints    2937
policy type                  2937
vehicle class                2937
total claim amount           2937
dtype: int64

In [9]:
my_df_types.dropna(axis=0,how="all",inplace=True)
my_df_types.fillna(axis=0,value="N/A",inplace=True)
my_df_types.to_csv("Nonulls_in_here.csv", index=False)
my_df_types.isnull().sum()

customer                     0
st                           0
gender                       0
education                    0
customer lifetime value      0
income                       0
monthly premium auto         0
number of open complaints    0
policy type                  0
vehicle class                0
total claim amount           0
dtype: int64

## Exercise 5: Dealing with duplicates

Use the .duplicated() method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the drop_duplicates() function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using .duplicated().

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

In [10]:
# Your code here
my_df_types["customer"].duplicated().sum()#No costumer is duplicated, so all of them are unique
my_df_types.to_csv("Nonulls_in_here_dups_also.csv", index=False)

# Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting. 

Write these functions in a separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [3]:
# Your code here
'''def cleaning_dataframes(df):
    def low_clean_columns(column_name):
        column_name = re.sub(r"[^\w\s\%]", " ", str(column_name).lower())
        return column_name
    df.columns = {low_clean_columns(i) for i in df.columns}
    def types_setting(df):
        df_1 = df.convert_dtypes()
        df_1["customer lifetime value"] = df_1["customer lifetime value"].str.rstrip('%')#Elitminates all the strings
        df_1["customer lifetime value"] = df_1["customer lifetime value"].astype(float)
        return df_1
    def cleaning_nulls(df):
        df.dropna(axis=0,how="all",inplace=True) #Cleaning Null Values in the Dataframe
        df.fillna(axis=0,value="N/A",inplace=True)
        return df
    def checking_dup(df):
        df["customer"].duplicated().sum()
        return df
    df.columns = {low_clean_columns(i) for i in df.columns}
    df=types_setting(df)
    df=cleaning_nulls(df)
    df=checking_dup(df)
    return df'''
import pandas as pd
import cleaning
my_csv = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")#read cSV
my_df = pd.DataFrame(my_csv)
final_df = cleaning.cleaning_dataframes(my_df)
final_df.dtypes

customer                      object
st                            object
gender                        object
education                     object
customer lifetime value      float64
income                       float64
monthly premium auto         float64
number of open complaints     object
policy type                   object
vehicle class                 object
total claim amount           float64
dtype: object

# Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we tried to do work with that column, we wouldn't have been able to do it because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, lets get some more interesting insights!

Instructions:

- Review again the statistics for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the .describe() method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [12]:
# Your code here
high_policy=final_df["total claim amount"].quantile(0.75)
low_costumer=final_df["customer lifetime value"].quantile(.25)

final_data= final_df[(final_df["total claim amount"] > high_policy) &
                  (final_df["customer lifetime value"] < low_costumer)]
final_data.describe()

,customer lifetime value,income,monthly premium auto,total claim amount
count,38.000000,38.000000,38.000000,38.000000
mean,338379.963421,16304.815789,92.631579,719.266560
std,56613.837996,23994.372012,15.922822,146.929965
min,228759.690000,0.000000,63.000000,537.600000
25%,294655.805000,0.000000,82.000000,632.936536
50%,363799.330000,0.000000,96.500000,685.284189
75%,385848.412500,27981.750000,104.500000,797.400000
max,401654.200000,92600.000000,112.000000,1185.988301